package KI_304.BodnarN_Lab3;

/**
 * Інтерфейс {@code Experimental} визначає методи для проведення експериментів.
 * Він включає методи для виконання експерименту, запису результатів, перевірки
 * готовності до експерименту та отримання історії експериментів.
 */
interface Experimental {

    /**
     * Проводить експеримент.
     * Викликається для початку експериментальної процедури.
     */
    void conductExperiment();

    /**
     * Записує результати експерименту.
     *
     * @param results Результати експерименту у вигляді рядка.
     */
    void recordResults(String results);

    /**
     * Перевіряє, чи об'єкт готовий до проведення експерименту.
     *
     * @return {@code true}, якщо об'єкт готовий і здоровий для експерименту; {@code false} в іншому випадку.
     */
    boolean isHealthyForExperiment();

    /**
     * Повертає історію проведених експериментів.
     *
     * @return Історія експериментів у вигляді рядка.
     */
    String getExperimentHistory();
}
